const cities = {
  'Самсана': {
    'Таверна': ['Заказать питье', 'Бросить вызов в дартс', 'Вернуться в город'],
    'Центр инженерии': ['Исследовать новые технологии', 'Ремонтировать снаряжение', 'Вернуться в город'],
    'Лазарет': ['Лечиться', 'Получить информацию о здоровье', 'Вернуться в город'],
    'Городская ратуша': ['Встретиться с мэром', 'Получить задание', 'Вернуться в город']
  },
  'Дирра': {
    'Таверна': ['Заказать питье', 'Сыграть в карты', 'Вернуться в город'],
    'Рынок': ['Купить товары', 'Продать товары', 'Вернуться в город'],
    'Арена': ['Сразиться в поединке', 'Наблюдать за боями', 'Вернуться в город']
  },
  'Прима-Хара': {
    'Библиотека': ['Изучить книги', 'Получить информацию', 'Вернуться в город'],
    'Мастерская': ['Создать предмет', 'Улучшить оружие', 'Вернуться в город'],
    'Площадь': ['Участвовать в мероприятиях', 'Подойти к фонтану', 'Вернуться в город']
  }
};

export { cities };