const cities = {
  'Самсана': {
    'Таверна': ['Заказать питье', 'Бросить вызов в дартс', 'Отдохнуть', 'Вернуться в город'],
    'Рынок': ['Купить товары', 'Продать товары', 'Вернуться в город'],
    'Казармы': ['Нанять войско', 'Вернуться в город'],
    'Госпиталь': ['Лечиться', 'Получить информацию о здоровье', 'Вернуться в город'],
    'Городская ратуша': ['Встретиться с мэром', 'Получить задание', 'Вернуться в город']
  },
  'Дирра': {
    'Таверна': ['Заказать питье', 'Сыграть в карты', 'Вернуться в город'],
    'Торговые улицы': ['Купить товары', 'Продать товары', 'Вернуться в город'],
    'Казармы': ['Нанять войско', 'Вернуться в город'],
    'Центр инженерии': ['Исследовать новые технологии', 'Ремонтировать снаряжение', 'Вернуться в город'],
    'Больница': ['Вылечить здоровье', 'Получить информацию о здоровье', 'Вернуться в город'],
    'Арена': ['Сразиться в поединке', 'Наблюдать за боями', 'Вернуться в город'],
  },
  'Прима-Хара': {
    'Таверна': ['Заказать питье', 'Сыграть в карты', 'Вернуться в город'],
    'Мастерская': ['Создать предмет', 'Улучшить оружие', 'Вернуться в город'],
    'Торговый район': ['Купить товары', 'Продать товары', 'Вернуться в город'],
    'Казармы': ['Нанять войско', 'Вернуться в город'],
    'Центр инженерии': ['Исследовать новые технологии', 'Ремонтировать снаряжение', 'Вернуться в город'],
    'Медицинский корпус': ['Вылечить здоровье', 'Получить информацию о здоровье', 'Вернуться в город'],
    'Площадь': ['Участвовать в мероприятиях', 'Подойти к фонтану', 'Вернуться в город'],
    'Колизей': ['Сразиться в поединке', 'Наблюдать за боями', 'Вернуться в город'],
    
  }
};

export default cities;
